tags/4.0_rc2/tools/ServiceProfiles/profiles/examples/gea0002/incorrect1.xml

<?xml version="1.0" encoding="UTF-8"?>
<!-- example adopted from http://www.w3.org/TR/wsdl -->
<soap-env:Envelope soap-env:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:soap-enc="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsd="http://www.w3.org/1999/XMLSchema"
    xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance">
    <soap-env:Body>
        <m:getStateName xmlns:m="http://www.soapware.org/">
            <statenum xsi:type="xsd:int">41</statenum>
        </m:getStateName>
    </soap-env:Body>
</soap-env:Envelope>
